#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_membership.members["hoverbear"] will be created
  + resource "github_membership" "members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "admin"
      + username = "hoverbear"
    }

  # github_repository.organization will be created
  + resource "github_repository" "organization" {
      + allow_merge_commit = true
      + allow_rebase_merge = true
      + allow_squash_merge = true
      + archived           = false
      + default_branch     = (known after apply)
      + description        = "Our organization"
      + etag               = (known after apply)
      + full_name          = (known after apply)
      + git_clone_url      = (known after apply)
      + html_url           = (known after apply)
      + http_clone_url     = (known after apply)
      + id                 = (known after apply)
      + name               = "organization"
      + ssh_clone_url      = (known after apply)
      + svn_url            = (known after apply)
    }

  # github_team.maintainers will be created
  + resource "github_team" "maintainers" {
      + description = "Project Maintenance Committee"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "maintainers"
      + privacy     = "closed"
      + slug        = (known after apply)
    }

  # github_team.pmc will be created
  + resource "github_team" "pmc" {
      + description = "Project Maintenance Committee"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "pmc"
      + privacy     = "closed"
      + slug        = (known after apply)
    }

  # github_team.sig will be created
  + resource "github_team" "sig" {
      + description = "Special Interest Groups"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "sig"
      + privacy     = "closed"
      + slug        = (known after apply)
    }

  # github_team.wg will be created
  + resource "github_team" "wg" {
      + description = "Working Groups"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "wg"
      + privacy     = "closed"
      + slug        = (known after apply)
    }

  # github_team_membership.maintainers["hoverbear"] will be created
  + resource "github_team_membership" "maintainers" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "hoverbear"
    }

  # github_team_membership.pmc["hoverbear"] will be created
  + resource "github_team_membership" "pmc" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "hoverbear"
    }

  # github_team_membership.sig["hoverbear"] will be created
  + resource "github_team_membership" "sig" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "hoverbear"
    }

  # module.sig_copr.github_team.active will be created
  + resource "github_team" "active" {
      + description    = "Active Contributors for the copr SIG."
      + etag           = (known after apply)
      + id             = (known after apply)
      + name           = "copr-active"
      + parent_team_id = (known after apply)
      + privacy        = "closed"
      + slug           = (known after apply)
    }

  # module.sig_copr.github_team.committers will be created
  + resource "github_team" "committers" {
      + description    = "Committers for the copr SIG."
      + etag           = (known after apply)
      + id             = (known after apply)
      + name           = "copr-committers"
      + parent_team_id = (known after apply)
      + privacy        = "closed"
      + slug           = (known after apply)
    }

  # module.sig_copr.github_team.contributors will be created
  + resource "github_team" "contributors" {
      + description    = "Contributors for the copr SIG."
      + etag           = (known after apply)
      + id             = (known after apply)
      + name           = "copr-contributors"
      + parent_team_id = (known after apply)
      + privacy        = "closed"
      + slug           = (known after apply)
    }

  # module.sig_copr.github_team.leaders will be created
  + resource "github_team" "leaders" {
      + description    = "Leaders for the copr SIG."
      + etag           = (known after apply)
      + id             = (known after apply)
      + name           = "copr-leaders"
      + parent_team_id = (known after apply)
      + privacy        = "closed"
      + slug           = (known after apply)
    }

  # module.sig_copr.github_team.reviewers will be created
  + resource "github_team" "reviewers" {
      + description    = "Reviewers for the copr SIG."
      + etag           = (known after apply)
      + id             = (known after apply)
      + name           = "copr-reviewers"
      + parent_team_id = (known after apply)
      + privacy        = "closed"
      + slug           = (known after apply)
    }

  # module.sig_copr.github_team.sig will be created
  + resource "github_team" "sig" {
      + description    = "The copr sig"
      + etag           = (known after apply)
      + id             = (known after apply)
      + name           = "copr"
      + parent_team_id = (known after apply)
      + privacy        = "closed"
      + slug           = (known after apply)
    }

  # module.sig_copr.github_team_membership.leaders["hoverbear"] will be created
  + resource "github_team_membership" "leaders" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "hoverbear"
    }

  # module.sig_copr.github_team_membership.sig["hoverbear"] will be created
  + resource "github_team_membership" "sig" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "hoverbear"
    }

  # module.sig_engine.github_team.active will be created
  + resource "github_team" "active" {
      + description    = "Active Contributors for the engine SIG."
      + etag           = (known after apply)
      + id             = (known after apply)
      + name           = "engine-active"
      + parent_team_id = (known after apply)
      + privacy        = "closed"
      + slug           = (known after apply)
    }

  # module.sig_engine.github_team.committers will be created
  + resource "github_team" "committers" {
      + description    = "Committers for the engine SIG."
      + etag           = (known after apply)
      + id             = (known after apply)
      + name           = "engine-committers"
      + parent_team_id = (known after apply)
      + privacy        = "closed"
      + slug           = (known after apply)
    }

  # module.sig_engine.github_team.contributors will be created
  + resource "github_team" "contributors" {
      + description    = "Contributors for the engine SIG."
      + etag           = (known after apply)
      + id             = (known after apply)
      + name           = "engine-contributors"
      + parent_team_id = (known after apply)
      + privacy        = "closed"
      + slug           = (known after apply)
    }

  # module.sig_engine.github_team.leaders will be created
  + resource "github_team" "leaders" {
      + description    = "Leaders for the engine SIG."
      + etag           = (known after apply)
      + id             = (known after apply)
      + name           = "engine-leaders"
      + parent_team_id = (known after apply)
      + privacy        = "closed"
      + slug           = (known after apply)
    }

  # module.sig_engine.github_team.reviewers will be created
  + resource "github_team" "reviewers" {
      + description    = "Reviewers for the engine SIG."
      + etag           = (known after apply)
      + id             = (known after apply)
      + name           = "engine-reviewers"
      + parent_team_id = (known after apply)
      + privacy        = "closed"
      + slug           = (known after apply)
    }

  # module.sig_engine.github_team.sig will be created
  + resource "github_team" "sig" {
      + description    = "The Engine SIG focuses on improving TiKV's engine"
      + etag           = (known after apply)
      + id             = (known after apply)
      + name           = "engine"
      + parent_team_id = (known after apply)
      + privacy        = "closed"
      + slug           = (known after apply)
    }

  # module.sig_engine.github_team_membership.leaders["hoverbear"] will be created
  + resource "github_team_membership" "leaders" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "hoverbear"
    }

  # module.sig_engine.github_team_membership.sig["hoverbear"] will be created
  + resource "github_team_membership" "sig" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "hoverbear"
    }

  # module.wg_multi-dc-enhancement.github_team.wg will be created
  + resource "github_team" "wg" {
      + description    = "The multi-dc-enhancement WG focuses on improving TiKV's inter-DC functionality"
      + etag           = (known after apply)
      + id             = (known after apply)
      + name           = "multi-dc-enhancement"
      + parent_team_id = (known after apply)
      + privacy        = "closed"
      + slug           = (known after apply)
    }

Plan: 26 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `Terraform GitHub Actions`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`*
